{
  "-MSbz99qxklK-5rZWGmt":{
  "title": "How to design better logos",
  "text": "Logos are viewed as the most memorable part of a company and as such designing one is quite tricky.",
  "description": "A logo is a visual representation of your brand, so why tell people what you do if you could just show them? Use simple icons to communicate who you are.Remember the brand vibe we talked about earlier? The use of the plane and the sun here makes me feel excited and reminds me of warm sunny holidays.Visual puns are a designer’s best friend too – here Frost Bites have created a quirky ‘bite’ to show that they are a food company. This is really easily achieved by overlapping two circles that are the same color as the background.",
  "mainImg": "https://helpx.adobe.com/content/dam/help/en/illustrator/how-to/start-logo-design/jcr_content/main-pars/image/start-logo-design-intro_900x506.jpg",
  "imgCollection": ["https://img.freepik.com/free-vector/big-animals-set_1284-10911.jpg?size=338&ext=jpg", "https://cdn.pixabay.com/photo/2016/10/10/14/13/dog-1728494__480.png"],
  "_id": "-MSbz99qxklK-5rZWGmt"
}, 
"-MSc-8DwUmBi8NG52eOH":{
  "title": "The power of white spaces in design",
  "text": "Use of white spaces can be often scary, but it does not have to be with the correct amount of it.",
  "description": "Using white space evenly makes the content in design easily scannable and significantly improves legibility. A study conducted indicates that proper use of white space between lines of paragraphs and its left and right margins can increase comprehension up to 20%.",
  "mainImg": "https://miro.medium.com/max/2000/1*Sdmp6BLIdI84n3SEPHvFIQ.jpeg",
  "imgCollection": ["https://st3.depositphotos.com/4021867/13114/v/600/depositphotos_131147492-stock-illustration-watercolor-baby-vector-pattern.jpg", "https://us.123rf.com/450wm/comodo777/comodo7771503/comodo777150300003/37358991-farm-animal-vector-set-with-no-background.jpg?ver=6"],
  "_id": "-MSc-8DwUmBi8NG52eOH"
},
"-MSgyY8fK5DetuiWvbbX":{
  "title": "How to style your site for 2022",
  "text": "With 2022 comes a new wave of new ideas and popular designs for sites",
  "description": "Sometimes the most effective site is the least complex one. One-page sites work best when their subject matter is narrower, like a portfolio or the presentation of a single idea. These sites evoke the feeling of holding a flyer or reading a poster. All the information you need to review is in one place without the distraction of navigation or searching multiple pages. It lets its subject be the focus of attention. This makes it more likely that a casual viewer will read the entire resume since everything they need is right up front.",
  "mainImg": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTT23WnaW1M0UMUBUOYHyFH5l7B_GHOY9KpFQ&usqp=CAU",
  "imgCollection": ["https://images.pexels.com/photos/41315/africa-african-animal-cat-41315.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-168504892-1568303467.png?crop=0.754xw:0.911xh;0.191xw,0.0454xh&resize=640:*"],
  "_id": "-MSgyY8fK5DetuiWvbbX"
},
"-MSgyo88wO16izQZCVjh": {
  "title": "Tips for making a rebrand design for a company",
  "text": "Rebranding is one very important part of changing the way a company functions and is seen and as such the design is of utmost importance.",
  "description": "As much as effective branding design is an art, it’s also a clearly defined science. In fact, it’s a topic that has been thoroughly studied by countless researchers over the past several decades. After all, when done right, branding design can have a dramatic impact on the way customers view a brand, whether or not they trust said brand, and in turn, its long-term growth and success. A very important part is to do your research on the company and the direction it is going in. Next, build a Brand That Works in Multiple Mediums, that can be used universally in more than one situation. Make sure to speak to your ideal buyer. Establish standalone icons and typography to further help the look that you are going for and work to make a unique style, that is both memorable and very represents the company is a positive light.",
  "mainImg": "https://assets.turbologo.com/blog/en/2020/07/19084412/logo-rebr-958x575.png",
  "imgCollection": ["https://i.natgeofe.com/n/cce82c9b-ffc9-4349-b8aa-f14acf3319f2/departments-covid-animals-tiger.jpg?w=636&h=420"],
  "_id": "-MSgyo88wO16izQZCVjh"
},
"-MSgho8iwj16kzQZCVjh": {
  "title": "Choosing the right font for you",
  "text": "Fonts often prove difficult to choose because of their sheer numbers, but they can be viewed on a much simpler level",
  "description": "Typography helps create harmony and consistency in a design. In brand identity design, it's important to create visual consistency across all platforms. In website design, this looks like using consistent heading and body fonts throughout the site.A good typeface can increase the reading pleasure of the viewer. It is important to choose the right typeface that is suited to the particular situation and even the best typefaces cannot be used effectively in every situation.It is important for a font to be legible in order for the reader to be able to distinguish one letter from another. There are many factors that need to be taken into account when considering the legibility of the text. These factors include character shapes, size of counters, character width, weight, ascender and descender length and stroke contrast.",
  "mainImg": "https://images.creativemarket.com/0.1.0/ps/9322674/1820/1214/m1/fpnw/wm0/bundle-01-.jpg?1604281200&s=52e000ed828319682812cfc2848de31f",
  "imgCollection": ["https://i.natgeofe.com/n/cce82c9b-ffc9-4349-b8aa-f14acf3319f2/departments-covid-animals-tiger.jpg?w=636&h=420"],
  "_id": "-MSgho8iwj16kzQZCVjh"
},
"-MSgyo884O163zQZCVj9": {
  "title": "How to re-ignite your creativity",
  "text": "The importance of learning to deal with creative blocks",
  "description": "Everyone has those moments when you can't simply think of anything creative. One of the greatest lessons I learned from four years of Art school is that design (and really anything creative) is a process. When you feel blocked creatively, the best thing you can do is work through it. Even if the work you are doing is terrible, silly, or unsuccessful, you must continue to work. One of my favorite exercises is to try to design the worst possible solution to the problem before me. Inevitably this helps get me on the right track. It seems like you're at a point where your taste has evolved beyond your skill. Design is the process of FINDING the right answer, not inventing it. All of the fundamental components of design (colors and typefaces and shapes and compositions and layouts) already exist, and the design process is about finding the best combination of these elements for your specific problem. Too many novice designers try to do this in their heads, thinking up a solution, then writing it off as bad or silly before creating it. Remove the filter. Make the first thing that pops into your head. Continue this process until you have a sea of solutions in front of you and then figure out which of them are working and in what ways. The second part is the truly hard part, and why many of the most influential, talented, and proven designers end up in the role of Art Director. Visually making things is easy once you've gotten the hang of it, figuring out which of those thing is working is really what design is.",
  "mainImg": "https://miuc.org/wp-content/uploads/2019/01/On-creativity-education-stress-and-thoughts.jpg",
  "imgCollection": ["https://i.natgeofe.com/n/cce82c9b-ffc9-4349-b8aa-f14acf3319f2/departments-covid-animals-tiger.jpg?w=636&h=420"],
  "_id": "-MSgyo884O163zQZCVj9"
}
}